app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]

  def edit
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "movies" SET "title" = ?, "duration" = ?, "updated_at" = ? WHERE "movies"."id" = 5  [["title", "Catwoman"], ["duration", "105min"], ["updated_at", Mon, 31 Mar 2014 16:30:00 UTC +00:00]]

  def destroy
    @movie = Movie.find(params[:id])
   if  @movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]