app/controllers/reviews_controller.rb

    def create

    	@review = @movie.reviews.new(review_params)
    	if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "sdgd"], ["created_at", Wed, 02 Apr 2014 15:49:06 UTC +00:00], ["movie_id", 5], ["name", "fg"], ["stars", 1], ["updated_at", Wed, 02 Apr 2014 15:49:06 UTC +00:00]]

    def set_movie
        @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]